[
    {
        "id": "adam",
        "name": "Prophet Adam (Alaihi As-salam)",
        "arabic_name": "آدم عليه السلام",
        "summary": "The first human being and prophet created by Allah from clay.",
        "story": "Allah the Almighty revealed: 'Remember when your Lord said to the angels: Verily, I am going to place mankind generations after generations on earth.' They said: 'Will You place therein those who will make mischief therein and shed blood, while we glorify You with praises and thanks and sanctify You.' Allah said: 'I know that which you do not know.'\n\nAllah taught Adam all the names of everything, then He showed them to the angels and said: 'Tell Me the names of these if you are truthful.' They (angels) said: 'Glory be to You, we have no knowledge except what You have taught us. Verily, it is You, the All-Knower, the All-Wise.'\n\nHe said: 'O Adam! Inform them of their names,' and when he had informed them of their names, He said: 'Did I not tell you that I know the unseen in the heavens and the earth, and I know what you reveal and what you have been hiding?'\n\nRemember when We said to the angels: 'Prostrate yourself before Adam' They prostrated except Iblis, he refused and was proud and was one of the disbelievers (disobedient to Allah).\n\nWe said: 'O Adam! Dwell you and your wife in the Paradise and both of you freely with pleasure and delight of things therein as wherever you will but come not near this tree or you both will be of the Zalimeen (wrongdoers).'\n\nThen the Satan made them slip therefrom (the Paradise), and got them out from that in which they were. We said: 'Get you down all with enmity between yourselves. On earth will be a dwelling place for you and an enjoyment for a time.' (Chapter 2:30-39, Qur'an)",
        "quranic_references": ["Quran 2:30-39", "Quran 7:11-25", "Quran 15:28-35"]
    },
    {
        "id": "nuh",
        "name": "Prophet Nuh (Noah)",
        "arabic_name": "نوح عليه السلام",
        "summary": "The prophet who built the ark and survived the great flood.",
        "story": "Prophet Nuh (peace be upon him) was sent to his people when they had gone astray and were worshipping idols. He called them to worship Allah alone for 950 years, but only a few believed in him.\n\nAllah commanded Nuh to build an ark, as He was going to send a great flood to destroy the disbelievers. Nuh built the ark as Allah instructed, and when the flood came, he took with him his family (except his disbelieving wife and son) and pairs of every animal.\n\nThe flood covered the entire earth, and all the disbelievers were drowned. After the flood subsided, the ark rested on Mount Judi, and Nuh and the believers started a new life on earth.\n\nAllah says in the Quran: 'And indeed, We sent Nuh to his people, and he remained among them a thousand years minus fifty years, and the flood seized them while they were wrongdoers.' (Quran 29:14)",
        "quranic_references": ["Quran 11:25-48", "Quran 23:23-30", "Quran 29:14"]
    },
    {
        "id": "ibrahim",
        "name": "Prophet Ibrahim (Abraham)",
        "arabic_name": "إبراهيم عليه السلام",
        "summary": "The friend of Allah and father of the prophets.",
        "story": "Prophet Ibrahim (peace be upon him) was born in a time when people worshipped idols. His father Azar was an idol maker. From a young age, Ibrahim questioned the worship of idols and sought the truth.\n\nOne night, Ibrahim looked at the stars, moon, and sun, but realized that these celestial bodies set and could not be gods. He declared: 'I have turned my face toward Him who created the heavens and the earth, inclining toward truth, and I am not of those who associate others with Allah.' (Quran 6:79)\n\nIbrahim destroyed the idols in his people's temple, leaving only the largest one. When questioned, he said the big idol had destroyed the others, challenging his people to ask the idol if it could speak. This made them realize the futility of idol worship.\n\nHis people threw him into a fire, but Allah commanded: 'O fire, be coolness and safety upon Ibrahim.' (Quran 21:69) The fire did not harm him.\n\nLater, Allah tested Ibrahim by commanding him to sacrifice his son Ismail. Both father and son submitted to Allah's will, but Allah replaced Ismail with a ram, establishing the tradition of sacrifice during Hajj.",
        "quranic_references": ["Quran 6:74-83", "Quran 21:51-73", "Quran 37:99-113"]
    },
    {
        "id": "yusuf",
        "name": "Prophet Yusuf (Joseph)",
        "arabic_name": "يوسف عليه السلام",
        "summary": "The prophet known for his beauty, wisdom, and interpretation of dreams.",
        "story": "Prophet Yusuf (peace be upon him) was the beloved son of Prophet Yaqub (Jacob). As a child, he had a dream of eleven stars, the sun, and the moon prostrating to him.\n\nHis brothers became jealous of their father's love for Yusuf and plotted against him. They threw him into a well and told their father that a wolf had killed him. A caravan found Yusuf and sold him as a slave in Egypt.\n\nYusuf was bought by the chief minister of Egypt. The minister's wife tried to seduce him, but Yusuf refused and was imprisoned. In prison, he interpreted dreams for fellow prisoners, including the king's cupbearer.\n\nWhen the king had troubling dreams, the cupbearer remembered Yusuf's ability. Yusuf interpreted the king's dreams, predicting seven years of abundance followed by seven years of famine. Impressed, the king appointed Yusuf as treasurer of Egypt.\n\nDuring the famine, Yusuf's brothers came to Egypt for grain. Eventually, Yusuf revealed his identity and forgave them, saying: 'No blame will there be upon you today. Allah will forgive you; and He is the most merciful of the merciful.' (Quran 12:92)\n\nThe family was reunited in Egypt, fulfilling Yusuf's childhood dream.",
        "quranic_references": ["Quran 12:1-111"]
    },
    {
        "id": "musa",
        "name": "Prophet Musa (Moses)",
        "arabic_name": "موسى عليه السلام",
        "summary": "The prophet who led the Israelites out of Egypt and received the Torah.",
        "story": "Prophet Musa (peace be upon him) was born during a time when Pharaoh was oppressing the Israelites in Egypt. Pharaoh had ordered the killing of all newborn Israelite boys, but Allah saved Musa.\n\nMusa's mother, inspired by Allah, put him in a basket and placed it in the river. Pharaoh's wife found the basket and adopted Musa, not knowing he was an Israelite.\n\nAs an adult, Musa accidentally killed an Egyptian who was fighting an Israelite. He fled to Midian, where he married and became a shepherd. One day, while tending sheep, he saw a burning bush that was not consumed by fire. Allah spoke to him from the bush, appointing him as a prophet to Pharaoh.\n\nMusa returned to Egypt with his brother Harun (Aaron) and demanded that Pharaoh free the Israelites. When Pharaoh refused, Allah sent ten plagues upon Egypt. Finally, Pharaoh agreed to let them go.\n\nMusa led the Israelites out of Egypt, but Pharaoh changed his mind and pursued them. When they reached the Red Sea, Allah commanded Musa to strike the sea with his staff. The sea parted, allowing the Israelites to cross safely, while Pharaoh and his army drowned.\n\nLater, Musa received the Torah (Tawrat) on Mount Sinai, containing guidance and laws for his people.",
        "quranic_references": ["Quran 2:49-61", "Quran 7:103-162", "Quran 20:9-98"]
    },
    {
        "id": "isa",
        "name": "Prophet Isa (Jesus)",
        "arabic_name": "عيسى عليه السلام",
        "summary": "The Messiah born to Virgin Maryam, who performed miracles by Allah's permission.",
        "story": "Prophet Isa (peace be upon him) was born to Maryam (Mary) through a miraculous birth without a father. The angel Jibril (Gabriel) appeared to Maryam and announced that Allah would grant her a pure son.\n\nIsa spoke from the cradle as a baby, defending his mother's honor and declaring his prophethood: 'Indeed, I am the servant of Allah. He has given me the Scripture and made me a prophet.' (Quran 19:30)\n\nAs he grew up, Allah granted Isa many miracles: he could heal the blind and the leper, bring the dead back to life, and create birds from clay - all by Allah's permission. He was given the Injil (Gospel) as guidance for the Children of Israel.\n\nIsa called his people to worship Allah alone and follow the straight path. He chose twelve disciples who believed in him and supported his mission.\n\nWhen the religious leaders plotted to kill him, Allah saved Isa by raising him to the heavens. Someone else was made to resemble Isa and was crucified instead. Isa was not killed or crucified, as Allah says: 'And they did not kill him, nor did they crucify him; but another was made to resemble him to them.' (Quran 4:157)\n\nIsa will return before the Day of Judgment to establish justice on earth.",
        "quranic_references": ["Quran 3:45-55", "Quran 4:157-158", "Quran 19:16-34"]
    },
    {
        "id": "muhammad",
        "name": "Prophet Muhammad (Sallallahu Alaihi Wasallam)",
        "arabic_name": "محمد صلى الله عليه وسلم",
        "summary": "The final messenger of Allah, sent to all of humanity.",
        "story": "Prophet Muhammad (peace and blessings be upon him) was born in Mecca in the year 570 CE. He was known for his honesty and trustworthiness, earning the title 'Al-Amin' (the trustworthy) even before his prophethood.\n\nAt the age of 40, while meditating in the cave of Hira, the angel Jibril appeared to him with the first revelation: 'Read in the name of your Lord who created.' (Quran 96:1) This marked the beginning of his prophethood.\n\nInitially, he preached secretly to close family and friends. His wife Khadijah was the first to believe in him, followed by his cousin Ali and his friend Abu Bakr. After three years, he began preaching publicly.\n\nThe people of Mecca, especially the leaders, opposed his message of monotheism as it threatened their idol worship and economic interests. They persecuted the early Muslims, forcing some to migrate to Abyssinia.\n\nIn 622 CE, Muhammad and his followers migrated to Medina (the Hijra), marking the beginning of the Islamic calendar. In Medina, he established the first Islamic state based on justice and equality.\n\nAfter several battles and treaties, Muhammad returned to Mecca in 630 CE, forgiving his former enemies and cleansing the Kaaba of idols. By the time of his death in 632 CE, most of the Arabian Peninsula had accepted Islam.\n\nHis final sermon emphasized equality, justice, and the completion of the religion: 'Today I have perfected your religion for you, completed My favor upon you, and have chosen for you Islam as your religion.' (Quran 5:3)",
        "quranic_references": ["Quran 96:1-5", "Quran 5:3", "Quran 33:40"]
    }
]

